# Алгоритм 
# 1. Задать пользователя
# 2. Получить и запомнить ответ
# 3. Создать строку приветствия
# 4. Добавить в нее полученное имя
# 5. Вывести приветствие с именем на экран
#
# Создание переменной answer
# answer со знаком присваивания '=' так как '==' это знак равенства в python
# Вопрос пользователю : input('произвольный текст')
answer = input ('Как тебя зовут?')
# Как вывести значение на экран? Через print
print ('Привет ' + answer)