#result = 0
#znam = int(input('Введите число, я найду обратное:'))
#try:
#    result = 1 / znam
#except ZeroDivisionError:
#    result = None
#if result:
#    print('Обратное равно ', result)
#
# Написать программу, которая спрашивает возраст, выбрасывает исключение,
# если введенное число отрицательное, в противном случае считает год рождения.

result = 0
dob = int(input('Введите свой год рождения: '))
try:
    result = 1 / znam
except ZeroDivisionError:
    result = None
if result:
    print('Обратное равно ', result)
