#2. Программа спрашивает число. Напечатать столбик,
#содержащий столько звездочек, чему равно число
#
#Введите число: 4
a = input('Введите число: ')
a = int(a)
while a != 0:
    print ('*')
    a = a - 1   
#*
#*
#*
#*

#3. Напечатать строку из стольких звездочек, чему равно число
#Введите число: 4
#****

#4. Напечатать квадратик из звездочек со стороной, равной числу
#Введите число: 4
#****
#****
#****
#****

#5. Напечатать пустой квадратик, со стороной равной числу
#Введите число: 4
#****
#*  *
#*  *
#****

#6. Напечатать квадратик в шахматном порядке
#Введите число: 4
#* * 
# * *
#* * 
# * *

#7. Напечатать прямоугольный треугольник возрастающий
#Введите число: 4
#*
#**
#***
#****

#8. Напечатать прямоугольный треугольник убывающий
#Введите число: 4
#****
#***
#**
#*

#9. Напечатать равнобедренный треугольник (не для всех чисел удобно!)
#Введите число: 3
#  *
# ***
#*****