# Напишите букву а на экране 1980 раз.
print ('З А Д А Н И Е  N 1')
print ('a' * 1980)
print ('------------К--О--Н--Е--Ц------------')
#Нарисуйте "ковёр" 10*10 из букв ш, не используя цикл.
# А теперь, используя цикл.
print ('З А Д А Н И Е  N 2')
a = input('Введите ширину ковра: ')
a = int(a)
b = a
while a != 0:
    print ('Ш' * b)
    a = a - 1
print ('------------К--О--Н--Е--Ц------------')
# Нарисуйте "шахматный" ковёр из букв о и точек.
print ('З А Д А Н И Е  N 3')
a = input('Введите ширину ковра: ')
b = input('Введите размер клетки ковра: ')
a = int(a)
# переменная ширины ковра
e = a
# А теперь, чтоб размер клетки доски был не в один символ, а 3*3
# А теперь, m*n.
b = int(b)
c = b - 1
d = c
while a != 0:
    print ((('o' * b) + ('.' * b)) * e)
    while c != 0:
        print ((('o' * b) + ('.' * b)) * e)
        c = c - 1
    print (('.' * b + 'o' * b) * e)
    while d != 0:
        print (('.' * b + 'o' * b) * e)
        d = d - 1
    a = a - 1
print ('------------К--О--Н--Е--Ц------------')