# вывести одним принтом в столбик числа от 1 до 5 с использованием 6 аргументов.
print (1, 2, 3, 4, 5, sep='\t')
# С использованием 1-го аргумента.
print ('6\n7\n8\n9\n0')
# Вывести тремя принтами три слова в одну строку через запятую.
print('hi')
print('my', end='')
print('friend', end='bye')
# С клавиатуры вводится строка. Сколько в ней символов? Вводится число. Сколько в нем цифр?
slovo = input('Введите любое слово:')
print (len(slovo))
cifra = input('Введите любое число:')
cifra = int(cifra)
print (len(slovo))